import os
import time

class Config(object):
    # Pyrogram Client
    API_ID    = int(os.environ.get("API_ID", "39930006"))  # ⚠️ Required
    API_HASH  = os.environ.get("API_HASH", "0c1afd87f1a69d0e9a8b06b779480f51") # ⚠️ Required
    BOT_TOKEN = os.environ.get("BOT_TOKEN", "8978096986:AAGy0dIqHsS1DkufxwQGxssICRBnwHw4LoQ") # ⚠️ Required
    
    # Other Configs
    BOT_START_TIME = time.time()
    OWNER = int(os.environ.get("OWNER", "8871937776")) # ⚠️ Required

    # Web Response Config
    WEBHOOK = bool(os.environ.get("WEBHOOK", True))
    PORT = int(os.environ.get("PORT", "8080"))

class Txt(object):

    SEND_NUMBERS_MSG = """
❪ 𝐒‌𝐄‌𝐍‌𝐃‌ 𝐓‌𝐇‌𝐄‌ 𝐓‌𝐎‌𝐓‌𝐀‌𝐋‌ 𝐍‌𝐔‌𝐌‌𝐁‌𝐄‌𝐑‌ 𝐘‌𝐎‌𝐔‌ 𝐇‌𝐀‌𝐕‌𝐄‌ ❫

☛ 𝐇‌σᴡ ϻᴧηʏ 𝐍‌υϻʙєꝛ ᴅσ 𝐘‌συ ʜᴧᴠє
"""

    SEND_TARGET_CHANNEL = """
( 𝐒‌𝐄‌𝐍‌𝐃‌ 𝐓‌𝐇‌𝐄‌ 𝐓‌𝐀‌𝐑‌𝐆‌𝐄‌𝐓‌ 𝐂‌𝐇‌𝐀‌𝐍‌𝐍‌𝐄‌𝐋‌ 𝐋‌𝐈‌𝐍‌𝐊‌ σꝛ 𝐔‌𝐒‌𝐄‌𝐑‌𝐍‌𝐀‌𝐌‌𝐄‌ )

☛ 𝐅‌σꝛ є.ɢ :- <code> @AIORFT </code> σꝛ <code> https:/t.me/AIORFT </code>
"""

    SEND_SESSION_MSG = """
❪ 𝐒‌𝐄‌𝐍‌𝐃‌ 𝐒‌𝐄‌𝐒‌𝐒‌𝐎‌𝐈‌𝐍‌ 𝐒‌𝐓‌𝐑‌𝐈‌𝐍‌𝐆‌ ❫

☛ 𝐆‌єηєꝛᴧᴛє 𝐒‌єssɪση 𝐒‌ᴛꝛɪηɢ ғσꝛϻ @SessionxGenBot


"""

    SEND_API_ID = """
❪ 𝐒‌𝐄‌𝐍‌𝐃‌ 𝐀‌𝐏‌𝐈‌ 𝐈‌𝐃‌ ❫

☛ 𝐀‌ᴘɪ_ɪᴅ 𝐆‌єᴛ ғꝛσϻ my.telegram.org
"""
    SEND_API_HASH = """
❪ 𝐒‌𝐄‌𝐍‌𝐃‌ 𝐀‌𝐏‌𝐈‌ 𝐇‌𝐀‌𝐒‌𝐇‌ ❫

☛ 𝐀‌ᴘɪ_ʜᴧsʜ 𝐆‌єᴛ ғꝛσϻ my.telegram.org
"""

    MAKE_CONFIG_DONE_MSG = """
𝐘‌συꝛ {} ᴧᴄᴄσυηᴛs ʜᴧs ʙєєη ᴧᴅᴅєᴅ 👥

𝐀‌ηᴅ ʟσɢɪηєᴅ ᴛσ ᴛʜє 𝐓‌ᴧꝛɢєᴛ 𝐂‌ʜᴧηηєʟ/𝐆‌ꝛσυᴘ ᴛσ 𝐑‌єᴘσꝛᴛ ɪᴛ. ✅

➜ 𝐂‌ʟɪᴄᴋ ᴛʜє ʙυᴛᴛση ʙєʟʟσᴡ ᴛσ sєє ᴛʜє 𝐍‌υϻʙєꝛ σғ 𝐓‌єʟєɢꝛᴧϻ ᴧᴄᴄσυηᴛ ʏσυ ᴧᴅᴅєᴅ.
"""

    ADDED_ACCOUNT = """
𝐘‌συꝛ ʜᴧᴠє ᴧᴅᴅєᴅ {} ᴧᴄᴄσυηᴛs 👥

➜ 𝐂‌ʟɪᴄᴋ ᴛʜє ʙυᴛᴛση ʙєʟʟσᴡ ᴛσ sєє ᴛʜє 𝐌‌σꝛє 𝐈‌ηғσ σғ ᴛʜє 𝐓‌єʟєɢꝛᴧϻ ᴧᴄᴄσυηᴛs ᴡʜɪᴄʜ ʏσυ ʜᴧᴠєᴅ ᴧᴅᴅєᴅ.
"""

    ACCOUNT_INFO = """
<b> 𝐍‌ᴧϻє :- </b> <code> {0} </code>
<b> 𝐔‌sєꝛ 𝐈‌ᴅ :- </b> <code> {1} </code>
"""

    REPORT_CHOICE = """
❪ 𝐒‌𝐄‌𝐋‌𝐄‌𝐂‌𝐓‌ 𝐑‌𝐄‌𝐀‌𝐒‌𝐎‌𝐍‌ 𝐅‌𝐎‌𝐑‌ 𝐑‌𝐄‌𝐏‌𝐎‌𝐑‌𝐓‌ 👤 ❫

𝟷. 𝐑‌єᴘσꝛᴛ ғσꝛ ᴄʜɪʟᴅ ᴧʙυsє
𝟸. 𝐑‌єᴘσꝛᴛ ғσꝛ ᴄσᴘʏꝛɪɢʜᴛєᴅ ᴄσηᴛєηᴛ
𝟹. 𝐑‌єᴘσꝛᴛ ғσꝛ ɪϻᴘєꝛsσηᴧᴛɪση
𝟺. 𝐑‌єᴘσꝛᴛ ᴧη ɪꝛꝛєʟєᴠᴧηᴛ ɢєσɢꝛσυᴘ
𝟻. 𝐑‌єᴘσꝛᴛ ᴧη ɪʟʟєɢᴧʟ ᴅυꝛɢ
𝟼. 𝐑‌єᴘσꝛᴛ ғσꝛ 𝐕‌ɪσʟєηᴄє
𝟽. 𝐑‌єᴘσꝛᴛ ғσꝛ σғғєηsɪᴠє ᴘєꝛsση ᴅєᴛᴧɪʟ
𝟾. 𝐑‌єᴧsση ғσꝛ 𝐏‌σꝛησɢꝛᴧᴘʜʏ
𝟿. 𝐑‌єᴘσꝛᴛ ғσꝛ sᴘᴧϻ

𝐖‌ʜᴧᴛs ʏσυꝛ ꝛєᴧsση: sєʟєᴄᴛ 𝟷-𝟿 👇
"""

    SEND_NO_OF_REPORT_MSG = """
❪ 𝐒‌𝐄‌𝐋‌𝐄‌𝐂‌𝐓‌ 𝐍‌𝐔‌𝐌‌𝐁‌𝐄‌𝐑‌ 𝐎‌𝐅‌ 𝐑‌𝐄‌𝐏‌𝐎‌𝐑‌𝐓‌𝐒‌ 👤 ❫

**𝐒‌єηᴅ 𝐍‌υϻʙєꝛ σғ ꝛєᴘσꝛᴛs ᴡʜɪᴄʜ ʏσυ ᴡᴧηᴛ ᴛσ ꝛєᴘσꝛᴛ ᴛσ ᴛʜɪs @{}**

𝐓‌ʜє ʙσᴛ ᴡɪʟʟ ᴋєєᴘ ꝛєᴘσꝛᴛɪηɢ ᴛσ ᴛᴧꝛɢєᴛ ᴄʜᴧηηєʟ σꝛ ɢꝛσυᴘ υηᴛɪʟ ɪᴛ's ꝛєᴧᴄʜ ᴛʜє ηυϻʙєꝛ σғ ꝛєᴘσꝛᴛ. 🎯
"""

    START_MSG = """
𝐇‌ɪ {},

𝐓‌ʜɪs 𝐁‌σᴛ ɪs ғσꝛ ᴛσ ꝛєᴘσꝛᴛ ᴄʜᴧηηєʟ σꝛ ɢꝛσυᴘ ɪη ϻᴧss ʟєᴠєʟ ᴛʜꝛσυɢʜ ᴛєʟєɢꝛᴧϻ ᴧᴄᴄσυηᴛ sєssɪση sᴛꝛɪηɢ ᴡʜɪᴄʜ ʏσυ ᴄᴧη ɢєηєꝛᴧᴛє ʙʏ @SessionxGenBot.

𝐓‌ʜɪs ʙσᴛ ɪs sσʟєʟʏ ᴄꝛєᴧᴛє σꝛ ᴅєᴠєʟσᴘєᴅ ʙʏ :- @CreativeAxiom
"""

    HELP_MSG = """
🔆 𝐇‌𝐄‌𝐋‌𝐏‌

📚 𝐀‌ᴠᴧɪʟᴧʙʟє ᴄσϻϻᴧηᴅs:
⏣ /start - ᴄʜєᴄᴋ 𝐈‌'ϻ ᴧʟɪᴠє
⏣ /make_config - 𝐓‌σ 𝐌‌ᴧᴋє 𝐂‌σηғɪɢ
⏣ /del_config - 𝐃‌єʟєᴛє ᴛʜє 𝐂‌σηғɪɢ
⏣ /target - 𝐓‌σ sєє ᴛʜє ᴛᴧꝛɢєᴛ ᴄʜᴧηηєʟ
⏣ /see_accounts - 𝐒‌єє ᴧʟʟ ᴛʜє ᴧᴄᴄσυηᴛs ʏσυ ᴧᴅᴅєᴅ
⏣ /add_account - 𝐀‌ᴅᴅ ηєᴡ ᴧᴄᴄσυηᴛs
⏣ /report - 𝐑‌єᴘσꝛᴛ ᴛʜє ᴛᴧꝛɢєᴛ
⏣ /restart - 𝐑‌єsᴛᴧꝛᴛ ᴛʜє ʙσᴛ

💢 𝐅‌єᴧᴛυꝛєs:
► 𝐑‌єᴘσꝛᴛ ᴧ sɪηɢʟє ᴄʜᴧηηєʟ σꝛ ɢꝛσυᴘ ᴡɪᴛʜ ϻυʟᴛɪᴘʟє 𝐈‌ᴅ's
► 𝐓‌ʏᴘє σғ ꝛєᴘσꝛᴛ σᴘᴛɪση ᴧᴠᴧɪʟᴧʙʟє
► 𝐅‌ᴧᴄɪʟɪᴛɪє ᴛσ ᴄʜᴧηɢє ᴛʜє 𝐓‌ᴧꝛɢєᴛ 𝐂‌ʜᴧηηєʟ σꝛ 𝐆‌ꝛσυᴘ
► 𝐅‌ᴧᴄɪʟɪᴛɪє ᴛσ ᴧᴅᴅ ᴛʜє ϻυʟᴛɪᴘʟєs ᴧᴄᴄσυηᴛs ᴧғᴛєꝛ σηᴄє ʏσυ ϻᴧᴋє ᴄσηғɪɢ
► 𝐀‌ʟʟ ᴛʜє ᴧᴄᴄσυηᴛs ʏσυ ᴧᴅᴅєᴅ ᴡɪʟʟ ᴧυᴛσϻᴧᴛɪᴄᴧʟʟʏ ᴊσɪηєᴅ ᴛʜє ᴛᴧꝛɢєᴛ ᴄʜᴧηηєʟ σꝛ ɢꝛσυᴘ
► 𝐍‌σ ηєєᴅ ᴛσ єηᴛєꝛ ᴘʜσηє ηυϻʙєꝛ, ᴘᴧssᴡσꝛᴅ σꝛ σᴛᴘ ᴊυsᴛ sєηᴅ sєssɪση sᴛꝛɪηɢ ᴧηᴅ ᴛʜᴧᴛ's ɪᴛ
► 𝐂‌ʜєᴄᴋ ᴛʜє sєꝛᴠєꝛ sᴛᴧᴛυs ᴧηᴅ ꝛєsσυꝛᴄєs
"""

    ABOUT_MSG = """
- 𝐌‌ʏ 𝐍‌ᴧϻє : <a href=https://t.me/{}>{}</a>
- 𝐂‌ꝛєᴧᴛσꝛ : <a href=https://t.me/creativeaxiom>Axiom</a>
- 𝐋‌ɪʙꝛᴧꝛʏ : Pyrogram
- 𝐋‌ᴧηɢυᴧɢє : 𝐏‌ʏᴛʜση 𝟹
- 𝐃‌ᴧᴛᴧ𝐁‌ᴧsє : MongoDB
- 𝐁‌𝐎‌𝐓‌ 𝐒‌єꝛᴠєꝛ : Anywhere
"""